/********************************************************************************
实验功能：第四界省赛程序设计
时间：2017.12.23
作者：吴康
*********************************************************************************/
#include <STC15F2K60S2.h>
#include <intrins.h>
#include <ds1302.h>
#include <iic.h>

#define uint unsigned int
#define uchar unsigned char

uchar code tab[]={0XC0,0XF9,0XA4,0XB0,0X99,0X92,0X82,0XF8,0X80,0X90,0XBF,0XFF};
uchar dsbuff[8]={11,11,11,11,11,11,11,11};
uchar s7=0,s6=0,s5=0,s4=0;	//按键设置标志位
uchar discount = 0;					//数码管显示控制变量
uchar jia=0,jian=0;					//在自动状态下，用作设置阈值的按键标志位
uchar adc =0;								//读出来的数据存储变量
uchar yuzhi=50;							//初始阈值

/********************************************************************************
函数名称：delayms
功能：延时函数
*********************************************************************************/
void delayms(uint xms)
{
	uint i,j;
	for(i=xms;i>0;i--)
	for(j=110;j>0;j--);
}

/********************************************************************************
函数名称：allinit
功能：板子整体初始化函数
*********************************************************************************/
void allinit()
{
	P2=0xa0;P0=0x00;//关闭蜂鸣器继电器
	P2=0x80;P0=0xff;//关闭所有LED灯
	P2=0xc0;P0=0xff;//选中所有数码管
	P2=0xe0;P0=0xff;//关闭所有数码管
}

/********************************************************************************
函数名称：display
功能：显示函数
*********************************************************************************/
void display()
{
	P2=0xef;
	P0=0xff;
	P2=0x1f;
	
	P2=0xcf;
	P0=1<<discount;
	P2=0x1f;
	
	P2=0xef;
	P0=tab[dsbuff[discount]];
	P2=0x1f;
	
	if(++discount==8) discount=0;
}

/********************************************************************************
函数名称：Timer0Init
功能：定时器0初始化函数
*********************************************************************************/
void Timer0Init(void)		//2毫秒@11.0592MHz
{
	AUXR |= 0x80;					//定时器时钟1T模式
	TMOD &= 0xF0;					//设置定时器模式
	TL0 = 0x9A;						//设置定时初值
	TH0 = 0xA9;						//设置定时初值
	TF0 = 0;							//清除TF0标志
	TR0 = 1;							//定时器0开始计时
	EA=1;
	ET0=1;
}

/********************************************************************************
函数名称：key
功能：按键初始化函数
*********************************************************************************/
void key()
{
	if(P30==0)
		{
			delayms(10);
			if(P30==0)
				{
					if(s7==0) s7=1;				//s7=1手动状态，s7=0自动状态
					else if(s7==1) s7=0;
				}
			while(!P30);
		}
	
	if(P31==0)
		{
			delayms(10);
			if(P31==0)
			{
				if(s6==0) s6=1;
					else if(s6==1) 
						{
							s6=0;
							write_date(0x22,yuzhi);//将设定的阈值存储在0x22地址里
						}
			}
			while(!P31);
		}
	
	if(P32==0)
		{
			delayms(10);
			if(P32==0)
				{
					s5=1;
					jia=1;
				}
			while(!P32);
		}
	
	if(P33==0)
		{
			delayms(10);
			if(P33==0)
				{
					s5=0;
					jian=1;
				}
			while(!P33);
		}
}

/********************************************************************************
函数名称：main
功能：主函数
*********************************************************************************/
void main()
{
	allinit();
	Timer0Init();
	ds_write();
	yuzhi=read_date(0x22);
	while(1)
	{
		key();
		adc=read_adc(0x03);
		ds_read();
		if(s7==1)//手动状态
			{
				P2=0x80;
				P0=0xfd;
				dsbuff[7]=adc%10;
				dsbuff[6]=adc/10;
				dsbuff[5]=11;
				dsbuff[4]=shijian[1]%10;
				dsbuff[3]=shijian[1]/10;
				dsbuff[2]=10;
				dsbuff[1]=shijian[2]%10;
				dsbuff[0]=shijian[2]/10;
				if((s6==0)&&adc<yuzhi)
					{
							P2=0xa0;
							P0=0x40;
							if(s5==1)							//如果s5按下，打开继电器
								{
									P2=0xa0;
									P0=0x50;		
								}
							else 
								{
									P2=0xa0;
									P0=0x40;
								}
					}
				else if((s6==0)&&(adc>=yuzhi))//判断按键是否按下，按下了将存储在0x22地址里的数据读出来进行比较
					{
							P2=0xa0;
							P0=0x00;
						if(s5==1)
							{
								P2=0xa0;
								P0=0x10;		
							}
						else 
							{
								P2=0xa0;
								P0=0x00;
							}
					}
					if(s6==1)
							{
								P2=0xa0;
								P0=0x00;
								if(s5==1)
									{
										P2=0xa0;
										P0=0x10;			
									}
								else 
									{
										P2=0xa0;
										P0=0x00;
									}
							}
		}
	else 
	 {
		P2=0x80;
		P0=0xfe;
		if(adc<yuzhi)		//自动状态下，将存储的数据进行比较
			{
				P2=0xa0;
				P0=0x10;
			}
		else 
			{
				P2=0xa0;
				P0=0x00;
			}
		if(s6==1)
			{
				dsbuff[7]=yuzhi%10;
				dsbuff[6]=yuzhi/10;
				dsbuff[5]=11;
				dsbuff[4]=11;
				dsbuff[3]=11;
				dsbuff[2]=11;	   
				dsbuff[1]=10;
				dsbuff[0]=10;
				if(jia==1)
					{
						yuzhi+=1;
						jia=0;
					}
				if(jian==1)
					{
						yuzhi-=1;
						jian=0;
					} 	
			}
		else 
			{	
				dsbuff[7]=adc%10;
				dsbuff[6]=adc/10;
				dsbuff[4]=shijian[1]%10;
				dsbuff[3]=shijian[1]/10;
				dsbuff[2]=10;	
				dsbuff[1]=shijian[2]%10;
				dsbuff[0]=shijian[2]/10;
			}
	 }
	}
}

/********************************************************************************
函数名称：Timer0
功能：定时器0的中断服务函数
*********************************************************************************/
void Timer0() interrupt 1
{
	display();
}